zzhchichige/tm4c123g/utils/uartstdio.c
//*****************************************************************************
//
//! A simple UART based printf function supporting \%c, \%d, \%p, \%s, \%u,
//! \%x, and \%X.
//!
//! \param pcString is the format string.
//! \param ... are the optional arguments, which depend on the contents of the
//! format string.
//!
//! This function is very similar to the C library <tt>fprintf()</tt> function.
//! All of its output will be sent to the UART.  Only the following formatting
//! characters are supported:
//!
//! - \%c to print a character
//! - \%d or \%i to print a decimal value
//! - \%s to print a string
//! - \%u to print an unsigned decimal value
//! - \%x to print a hexadecimal value using lower case letters
//! - \%X to print a hexadecimal value using lower case letters (not upper case
//! letters as would typically be used)
//! - \%p to print a pointer as a hexadecimal value
//! - \%\% to print out a \% character
//!
//! For \%s, \%d, \%i, \%u, \%p, \%x, and \%X, an optional number may reside
//! between the \% and the format character, which specifies the minimum number
//! of characters to use for that value; if preceded by a 0 then the extra
//! characters will be filled with zeros instead of spaces.  For example,
//! ``\%8d'' will use eight characters to print the decimal value with spaces
//! added to reach eight; ``\%08d'' will use eight characters as well but will
//! add zeroes instead of spaces.
//!
//! The type of the arguments after \e pcString must match the requirements of
//! the format string.  For example, if an integer was passed where a string
//! was expected, an error of some kind will most likely occur.
//!
//! \return None.
//
//*****************************************************************************
void
UARTprintf(const char *pcString, ...)
{
  va_list vaArgP;
  
  //
  // Start the varargs processing.
  //
  va_start(vaArgP, pcString);
  
  UARTvprintf(pcString, vaArgP);
  
  //
  // We're finished with the varargs now.
  //
  va_end(vaArgP);
}

//*****************************************************************************
//
//! Returns the number of bytes available in the receive buffer.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to determine the number
//! of bytes of data currently available in the receive buffer.
//!
//! \return Returns the number of available bytes.
//
//*****************************************************************************
#if defined(UART_BUFFERED) || defined(DOXYGEN)
int
UARTRxBytesAvail(void)
{
  return(RX_BUFFER_USED);
}
#endif

#if defined(UART_BUFFERED) || defined(DOXYGEN)
//*****************************************************************************
//
//! Returns the number of bytes free in the transmit buffer.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to determine the amount
//! of space currently available in the transmit buffer.
//!
//! \return Returns the number of free bytes.
//
//*****************************************************************************
int
UARTTxBytesFree(void)
{
  return(TX_BUFFER_FREE);
}
#endif

//*****************************************************************************
//
//! Looks ahead in the receive buffer for a particular character.
//!
//! \param ucChar is the character that is to be searched for.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to look ahead in the
//! receive buffer for a particular character and report its position if found.
//! It is typically used to determine whether a complete line of user input is
//! available, in which case ucChar should be set to CR ('\\r') which is used
//! as the line end marker in the receive buffer.
//!
//! \return Returns -1 to indicate that the requested character does not exist
//! in the receive buffer.  Returns a non-negative number if the character was
//! found in which case the value represents the position of the first instance
//! of \e ucChar relative to the receive buffer read pointer.
//
//*****************************************************************************
#if defined(UART_BUFFERED) || defined(DOXYGEN)
int
UARTPeek(unsigned char ucChar)
{
  int iCount;
  int iAvail;
  uint32_t ui32ReadIndex;
  
  //
  // How many characters are there in the receive buffer?
  //
  iAvail = (int)RX_BUFFER_USED;
  ui32ReadIndex = g_ui32UARTRxReadIndex;
  
  //
  // Check all the unread characters looking for the one passed.
  //
  for(iCount = 0; iCount < iAvail; iCount++)
  {
    if(g_pcUARTRxBuffer[ui32ReadIndex] == ucChar)
    {
      //
      // We found it so return the index
      //
      return(iCount);
    }
    else
    {
      //
      // This one didn't match so move on to the next character.
      //
      ADVANCE_RX_BUFFER_INDEX(ui32ReadIndex);
    }
  }
  
  //
  // If we drop out of the loop, we didn't find the character in the receive
  // buffer.
  //
  return(-1);
}
#endif

//*****************************************************************************
//
//! Flushes the receive buffer.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to discard any data
//! received from the UART but not yet read using UARTgets().
//!
//! \return None.
//
//*****************************************************************************
#if defined(UART_BUFFERED) || defined(DOXYGEN)
void
UARTFlushRx(void)
{
  uint32_t ui32Int;
  
  //
  // Temporarily turn off interrupts.
  //
  ui32Int = MAP_IntMasterDisable();
  
  //
  // Flush the receive buffer.
  //
  g_ui32UARTRxReadIndex = 0;
  g_ui32UARTRxWriteIndex = 0;
  
  //
  // If interrupts were enabled when we turned them off, turn them
  // back on again.
  //
  if(!ui32Int)
  {
    MAP_IntMasterEnable();
  }
}
#endif

//*****************************************************************************
//
//! Flushes the transmit buffer.
//!
//! \param bDiscard indicates whether any remaining data in the buffer should
//! be discarded (\b true) or transmitted (\b false).
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to flush the transmit
//! buffer, either discarding or transmitting any data received via calls to
//! UARTprintf() that is waiting to be transmitted.  On return, the transmit
//! buffer will be empty.
//!
//! \return None.
//
//*****************************************************************************
#if defined(UART_BUFFERED) || defined(DOXYGEN)
void
UARTFlushTx(bool bDiscard)
{
  uint32_t ui32Int;
  
  //
  // Should the remaining data be discarded or transmitted?
  //
  if(bDiscard)
  {
    //
    // The remaining data should be discarded, so temporarily turn off
    // interrupts.
    //
    ui32Int = MAP_IntMasterDisable();
    
    //
    // Flush the transmit buffer.
    //
    g_ui32UARTTxReadIndex = 0;
    g_ui32UARTTxWriteIndex = 0;
    
    //
    // If interrupts were enabled when we turned them off, turn them
    // back on again.
    //
    if(!ui32Int)
    {
      MAP_IntMasterEnable();
    }
  }
  else
  {
    //
    // Wait for all remaining data to be transmitted before returning.
    //
    while(!TX_BUFFER_EMPTY)
    {
    }
  }
}
#endif

//*****************************************************************************
//
//! Enables or disables echoing of received characters to the transmitter.
//!
//! \param bEnable must be set to \b true to enable echo or \b false to
//! disable it.
//!
//! This function, available only when the module is built to operate in
//! buffered mode using \b UART_BUFFERED, may be used to control whether or not
//! received characters are automatically echoed back to the transmitter.  By
//! default, echo is enabled and this is typically the desired behavior if
//! the module is being used to support a serial command line.  In applications
//! where this module is being used to provide a convenient, buffered serial
//! interface over which application-specific binary protocols are being run,
//! however, echo may be undesirable and this function can be used to disable
//! it.
//!
//! \return None.
//
//*****************************************************************************
#if defined(UART_BUFFERED) || defined(DOXYGEN)
void
UARTEchoSet(bool bEnable)
{
  g_bDisableEcho = !bEnable;
}
#endif

//*****************************************************************************
//
//! Handles UART interrupts.
//!
//! This function handles interrupts from the UART.  It will copy data from the
//! transmit buffer to the UART transmit FIFO if space is available, and it
//! will copy data from the UART receive FIFO to the receive buffer if data is
//! available.
//!
//! \return None.
//
//*****************************************************************************
#if defined(UART_BUFFERED) || defined(DOXYGEN)
void
UARTStdioIntHandler(void)
{
  uint32_t ui32Ints;
  int8_t cChar;
  int32_t i32Char;
  static bool bLastWasCR = false;
  
  //
  // Get and clear the current interrupt source(s)
  //
  ui32Ints = MAP_UARTIntStatus(g_ui32Base, true);
  MAP_UARTIntClear(g_ui32Base, ui32Ints);
  
  //
  // Are we being interrupted because the TX FIFO has space available?
  //
  if(ui32Ints & UART_INT_TX)
  {
    //
    // Move as many bytes as we can into the transmit FIFO.
    //
    UARTPrimeTransmit(g_ui32Base);
    
    //
    // If the output buffer is empty, turn off the transmit interrupt.
    //
    if(TX_BUFFER_EMPTY)
    {
      MAP_UARTIntDisable(g_ui32Base, UART_INT_TX);
    }
  }
  
  //
  // Are we being interrupted due to a received character?
  //
  if(ui32Ints & (UART_INT_RX | UART_INT_RT))
  {
    //
    // Get all the available characters from the UART.
    //
    while(MAP_UARTCharsAvail(g_ui32Base))
    {
      //
      // Read a character
      //
      i32Char = MAP_UARTCharGetNonBlocking(g_ui32Base);
      cChar = (unsigned char)(i32Char & 0xFF);
      
      //
      // If echo is disabled, we skip the various text filtering
      // operations that would typically be required when supporting a
      // command line.
      //
      if(!g_bDisableEcho)
      {
        //
        // Handle backspace by erasing the last character in the
        // buffer.
        //
        if(cChar == '\b')
        {
          //
          // If there are any characters already in the buffer, then
          // delete the last.
          //
          if(!RX_BUFFER_EMPTY)
          {
            //
            // Rub out the previous character on the users
            // terminal.
            //
            UARTwrite("\b \b", 3);
            
            //
            // Decrement the number of characters in the buffer.
            //
            if(g_ui32UARTRxWriteIndex == 0)
            {
              g_ui32UARTRxWriteIndex = UART_RX_BUFFER_SIZE - 1;
            }
            else
            {
              g_ui32UARTRxWriteIndex--;
            }
          }
          
          //
          // Skip ahead to read the next character.
          //
          continue;
        }
        
        //
        // If this character is LF and last was CR, then just gobble up
        // the character since we already echoed the previous CR and we
        // don't want to store 2 characters in the buffer if we don't
        // need to.
        //
        if((cChar == '\n') && bLastWasCR)
        {
          bLastWasCR = false;
          continue;
        }
        
        //
        // See if a newline or escape character was received.
        //
        if((cChar == '\r') || (cChar == '\n') || (cChar == 0x1b))
        {
          //
          // If the character is a CR, then it may be followed by an
          // LF which should be paired with the CR.  So remember that
          // a CR was received.
          //
          if(cChar == '\r')
          {
            bLastWasCR = 1;
          }
          
          //
          // Regardless of the line termination character received,
          // put a CR in the receive buffer as a marker telling
          // UARTgets() where the line ends.  We also send an
          // additional LF to ensure that the local terminal echo
          // receives both CR and LF.
          //
          cChar = '\r';
          UARTwrite("\n", 1);
        }
      }
      
      //
      // If there is space in the receive buffer, put the character
      // there, otherwise throw it away.
      //
      if(!RX_BUFFER_FULL)
      {
        //
        // Store the new character in the receive buffer
        //
        g_pcUARTRxBuffer[g_ui32UARTRxWriteIndex] =
          (unsigned char)(i32Char & 0xFF);
        ADVANCE_RX_BUFFER_INDEX(g_ui32UARTRxWriteIndex);
        
        //
        // If echo is enabled, write the character to the transmit
        // buffer so that the user gets some immediate feedback.
        //
        if(!g_bDisableEcho)
        {
          UARTwrite((const char *)&cChar, 1);
        }
      }
    }
    
    //
    // If we wrote anything to the transmit buffer, make sure it actually
    // gets transmitted.
    //
    UARTPrimeTransmit(g_ui32Base);
    MAP_UARTIntEnable(g_ui32Base, UART_INT_TX);
  }
}
#endif

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************
